
## :white_check_mark: Apply Succeeded (koyashiro.net)

[CI link](https://github.com/koyashiro/infra/actions/runs/8820342004)



<pre><code>Apply complete! Resources: 2 added, 1 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
cloudflare_record.txt_google_suite_verification: Refreshing state... [id=51aed5edfda688a4954fa9512bd6b0c7]
cloudflare_record.txt_spf: Refreshing state... [id=de681523c30bfdbf10f37cbe9cdff23a]
cloudflare_record.txt_dkim: Refreshing state... [id=f8676c4176fbdd3876b32c39e63d997c]
cloudflare_record.cname_cdn: Refreshing state... [id=7f50c261a33dc44e71e969c856b9d168]
cloudflare_record.mx_alt1: Refreshing state... [id=b42c903d6fe8ebe5dce8544e7cd1f86c]
cloudflare_record.mx_alt3: Refreshing state... [id=b992ff41459ab3f5b0e8dcc2bc694827]
cloudflare_record.txt_keybase_site_verification: Refreshing state... [id=08a9aea85efa8460b0e4ffcf4e9c1a0f]
cloudflare_record.mx_alt2: Refreshing state... [id=b739db8088696aca278313b2ee3e21c8]
cloudflare_record.txt_dmarc: Refreshing state... [id=ed72b5a4988759c6fba528f30aaf8774]
cloudflare_record.cname_vpm: Refreshing state... [id=2ecd27a583d3aa5d7c8ee4db71d77bc1]
cloudflare_record.txt_discord: Refreshing state... [id=6c2a03277c1c0316279abe5f302c5745]
cloudflare_record.txt_google_dkim: Refreshing state... [id=5d46eade5a06f5f800b978d4d3f6bbd0]
cloudflare_record.mx_alt4: Refreshing state... [id=219a76a69f8880eeae68cc527fdf64a0]
cloudflare_record.mx_primary: Refreshing state... [id=1ddf6f336013779c232ec6a394367d77]
cloudflare_record.cname_root: Refreshing state... [id=d58e18342013a85711948497d1a02b1a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # cloudflare_pages_domain.koyashiro_net will be created
  + resource "cloudflare_pages_domain" "koyashiro_net" {
      + account_id   = (sensitive value)
      + domain       = "koyashiro.net"
      + id           = (known after apply)
      + project_name = "koyashiro-net"
      + status       = (known after apply)
    }

  # cloudflare_pages_project.koyashiro_net will be created
  + resource "cloudflare_pages_project" "koyashiro_net" {
      + account_id        = (sensitive value)
      + created_on        = (known after apply)
      + domains           = (known after apply)
      + id                = (known after apply)
      + name              = "koyashiro-net"
      + production_branch = "main"
      + subdomain         = (known after apply)

      + build_config {
          + build_command   = "npm run build"
          + destination_dir = "out"
            # (1 unchanged attribute hidden)
        }

      + deployment_configs {
          + preview {
              + always_use_latest_compatibility_date = false
              + compatibility_date                   = (known after apply)
              + compatibility_flags                  = (known after apply)
              + environment_variables                = {
                  + "NODE_VERSION" = "20.12.2"
                }
              + fail_open                            = false
              + usage_model                          = "bundled"
            }
          + production {
              + always_use_latest_compatibility_date = false
              + compatibility_date                   = (known after apply)
              + compatibility_flags                  = (known after apply)
              + environment_variables                = {
                  + "NODE_VERSION" = "20.12.2"
                }
              + fail_open                            = false
              + usage_model                          = "bundled"
            }
        }

      + source {
          + type = "github"

          + config {
              + deployments_enabled           = true
              + owner                         = "koyashiro"
              + pr_comments_enabled           = true
              + preview_branch_excludes       = (known after apply)
              + preview_branch_includes       = (known after apply)
              + preview_deployment_setting    = "all"
              + production_branch             = "main"
              + production_deployment_enabled = true
              + repo_name                     = "koyashiro.net"
            }
        }
    }

  # cloudflare_record.cname_root will be updated in-place
  ~ resource "cloudflare_record" "cname_root" {
        id              = "d58e18342013a85711948497d1a02b1a"
        name            = "@"
        tags            = []
      ~ value           = "koyashiro.pages.dev" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
cloudflare_pages_project.koyashiro_net: Creating...
cloudflare_pages_project.koyashiro_net: Creation complete after 3s [id=koyashiro-net]
cloudflare_record.cname_root: Modifying... [id=d58e18342013a85711948497d1a02b1a]
cloudflare_record.cname_root: Modifications complete after 1s [id=d58e18342013a85711948497d1a02b1a]
cloudflare_pages_domain.koyashiro_net: Creating...
cloudflare_pages_domain.koyashiro_net: Creation complete after 1s [id=6261a929-2d8b-421d-9056-9859e2c64b5e]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":186,"Program":"tfcmt","SHA1":"25beaf8d43fc8507fa453199b2512d035daacc3b","Target":"koyashiro.net","Vars":{},"WorkflowName":"terraform"} -->